Repository: ryzamd/QC-Scan
Catalog: lib/l10n/intl_*.arb
Languages: vi

# appTitle
source: QC Scan
vi: Quét QC

# confirmButton
source: Confirm
vi: Xác nhận

# cancelButton
source: Cancel
vi: Hủy

# saveButton
source: Save
vi: Lưu

# clearButton
source: Clear
vi: Xóa

# deductionTitleUPCASE
source: DEDUCTION
vi: KHẤU TRỪ

# productLabel
source: Product:
vi: Sản phẩm:

# codeLabel
source: Code:
vi: Mã:

# currentQuantityLabel
source: Current Quantity:
vi: Số lượng hiện tại:

# deductionLabel
source: Deduction
vi: Khấu trừ

# reasonsLabel
source: Reasons
vi: Lý do

# selectButton
source: Select
vi: Chọn

source: No reasons selected
vi: Chưa chọn lý do

# selectReasonsTitleUPCASE
source: SELECT REASONS
vi: CHỌN LÝ DO

# cancelButtonUPCASE
source: CANCEL
vi: HỦY

# confirmButtonUPCASE
source: CONFIRM
vi: XÁC NHẬN

# errorTitleUPCASE
source: ERROR
vi: LỖI

# generalErrorMessage
source: An error occurred.
vi: Đã xảy ra lỗi.

# loadingMessage
source: Loading...
vi: Đang tải...

# networkErrorMessage
source: No internet connection. Please check your network settings and try again.
vi: Không có kết nối internet. Vui lòng kiểm tra mạng và thử lại.

# serverErrorMessage
source: Cannot connect to server.
vi: Không thể kết nối máy chủ.

# materialNotFound
source: Material not found in the system.
vi: Không tìm thấy vật liệu trong hệ thống.

# failureToProcess
source: Failed to process data.
vi: Không thể xử lý dữ liệu.

# failureToProcessWithCode
source: Failed to process material with code {code}.
vi: Không thể xử lý vật liệu mã {code}.

# noReasonsAvailableMessage
source: No reasons available
vi: Không có lý do

# loginFailedTitleUPCASE
source: LOGIN FAILED
vi: ĐĂNG NHẬP THẤT BẠI

# pleaseEnterUsername
source: Please enter your username
vi: Vui lòng nhập tên đăng nhập

# pleaseEnterPassword
source: Please enter your password
vi: Vui lòng nhập mật khẩu

# loginButton
source: Login
vi: Đăng nhập

# usernameHint
source: Please select username
vi: Chọn tên đăng nhập

# passwordHint
source: Enter password
vi: Nhập mật khẩu

# selectDepartmentLabel
source: Select Department
vi: Chọn phòng ban

# invalidCredentialsMessage
source: Wrong username or password
vi: Sai tên đăng nhập hoặc mật khẩu

# loginSuccessMessage
source: Login successful
vi: Đăng nhập thành công

# qcMenuTitle
source: QC Menu
vi: Menu QC

# qualityCheckMenuLabel
source: Quality Check
vi: Kiểm tra chất lượng

# qc1InspectionMenuLabel
source: QC1 Inspection
vi: Kiểm tra QC1

# qc2InspectionMenuLabel
source: QC2 Inspection
vi: Kiểm tra QC2

# noDataTitleUPCASE
source: NO DATA
vi: KHÔNG CÓ DỮ LIỆU

# noDataMessage
source: Please scan the QR code.
vi: Vui lòng quét mã QR.

# processingLoadingMessage
source: Processing...
vi: Đang xử lý...

# scanPageTitle
source: SCAN PAGE
vi: TRANG QUÉT

# noScanDataMessage
source: No scan data
vi: Không có dữ liệu quét

# successTitleUPCASE
source: SUCCESS
vi: THÀNH CÔNG

# dataProcessedSuccessMessage
source: Data processed successfully
vi: Dữ liệu đã xử lý thành công

# clearDataTitleUPCASE
source: CLEAR DATA
vi: XÓA DỮ LIỆU

# clearScannedDataConfirmMessage
source: Are you sure you want to clear all scanned data?
vi: Bạn có chắc muốn xóa tất cả dữ liệu đã quét?

# decreaseButton
source: Decrease
vi: Giảm

# increaseButton
source: Increase
vi: Tăng

# nameLabel
source: Name
vi: Tên

# totalQuantityLabel
source: Total
vi: Tổng

# dateLabel
source: Date
vi: Ngày

# supplierLabel
source: Supplier
vi: Nhà cung cấp

# cameraOffMessage
source: Camera is off
vi: Camera đã tắt

# initializingCameraMessage
source: Initializing camera...
vi: Đang khởi tạo camera...

# cameraErrorMessage
source: Camera error: {error}
vi: Lỗi camera: {error}

# tryAgainButton
source: Try Again
vi: Thử lại

# processingErorrMessage
source: An error occurred while processing the data.
vi: Đã xảy ra lỗi khi xử lý dữ liệu.

# connectionTimeoutMessage
source: Connection timeout. Please check your network.
vi: Kết nối hết hạn. Vui lòng kiểm tra mạng.

# cannotConnectToServerMessage
source: Cannot connect to server. Please check your network.
vi: Không thể kết nối máy chủ. Vui lòng kiểm tra mạng.

# networkErrorWithDetailsMessage
source: Network error: {details}
vi: Lỗi mạng: {details}

# serverErrorWithCodeMessage
source: Server returned error code: {code}
vi: Máy chủ trả về mã lỗi: {code}

# invalidTokenMessage
source: Invalid or expired token
vi: Token không hợp lệ hoặc hết hạn

# failedToGetMaterialInfoMessage
source: Failed to get material info
vi: Không thể lấy thông tin vật liệu

# unknownErrorMessage
source: Unknown error
vi: Lỗi không xác định

# eitherDeductionOrReasonsMessage
source: Please enter quantiy to deduct
vi: Vui lòng nhập số lượng để khấu trừ

# reasonsRequiredMessage
source: Reasons are required when deducting quantity
vi: Cần có lý do khi khấu trừ số lượng

# saveFailedMessage
source: Save failed
vi: Lưu thất bại

source: Failed to get deduction reasons
vi: Không thể lấy lý do khấu trừ

# failedToLoadProcessingItemsMessage
source: Failed to load processing items:
vi: Không thể tải mục đang xử lý:

# errorFetchingProcessingItemsMessage
source: Error fetching processing items
vi: Lỗi khi lấy mục đang xử lý

# errorProcessingDeductionMessage
source: Error processing deduction
vi: Lỗi khi xử lý khấu trừ

# quantityExceedsLimitMessage
source: The entered quantity exceeds the allowed limit
vi: Số lượng vượt quá giới hạn cho phép

# deductionExceedsQuantityMessage
source: Deduction cannot exceed current quantity
vi: Khấu trừ không thể vượt quá số lượng hiện tại

# deductionMustBeGreaterThanZeroMessage
source: Deduction must be greater than zero
vi: Khấu trừ phải lớn hơn không

# errorLoadingDataMessage
source: Error loading data: {details}
vi: Lỗi khi tải dữ liệu: {details}

# errorRefreshingDataMessage
source: Error refreshing data: {details}
vi: Lỗi khi làm mới dữ liệu: {details}

source: Item not found
vi: Không tìm thấy mục

# deductionSuccessMessage
source: Deduction processed successfully
vi: Đã xử lý khấu trừ thành công

# processTitlePageUPCASE
source: PROCESSING
vi: ĐANG XỬ LÝ

# projectCodeLabel
source: PR Code
vi: Mã PR

# searchHintText
source: Search
vi: Tìm kiếm

# logoutFailedTitleUPCASE
source: LOGOUT FAILED
vi: ĐĂNG XUẤT THẤT BẠI

# logoutDialogTitleUPCASE
source: LOGOUT
vi: ĐĂNG XUẤT

# logoutConfirmationMessage
source: Are you sure you want to log out?
vi: Bạn có chắc muốn đăng xuất không?

# logoutButtonTextUPCASE
source: LOGOUT
vi: ĐĂNG XUẤT

# profilePageTitleUPCASE
source: PROFILE
vi: HỒ SƠ

# profilePageSubtitle
source: Quality Control
vi: Kiểm soát chất lượng

# exitTheAppMessage
source: Are you sure you want to exit the app?
vi: Bạn có chắc muốn thoát ứng dụng không?

# exitTitleUPCASE
source: EXIT
vi: THOÁT

# noDataMessageTable
source: No data
vi: Không có dữ liệu

# alreadyQuantityInspectedMessage
source: Already quality inspected
vi: Đã kiểm tra chất lượng

# defaultDeductionButton
source: Default
vi: Mặc định

# virtualDeductionButton
source: Virtual
vi: Trừ ảo

# invalidQuantityNumberMessage
source: Invalid quantity number
vi: Số lượng không hợp lệ
